In [ ]:
def addition(*args):
    tiger = 0
    for item in args:
        tiger = item + tiger
        
    print(tiger)

In [ ]:
addition(1,2,3,4)

In [ ]:
def strin(*args):
    result = ''
    for item in args:
        res = item[0]
        result = result + res
        
    print(result)

In [ ]:
strin('RAM','SITA','ahri')

In [ ]:
'a' + ''

In [ ]:
'r'+ 'a'

In [ ]:
def stra(*args):
    result = ''
    for item in args:
        a = item[0]
        result = result + a
        print(result)

In [ ]:
stra('RAM','SITA','ahri')

In [ ]:
def dig(*args):
    res = 0
    for item in args:
        b = str(item)
        a = b[2]
        print(a)

In [ ]:
dig(8935,17853)

In [ ]:
a = ('2354','678','432')
a[0][1]

In [ ]:
s = ('111','hgkje')
s[0]

In [ ]:
c = (79852,5267)
for item in c:
    b = str(item)
    print(b)

In [ ]:
dig(8935,17853)

In [ ]:
b = (1,2,3,4)
str(b)

In [ ]:
#a = ('2','3','4')

a = str(b[0])
a

In [ ]:
b = (222,6666)
str(b)

In [ ]:
def uganda(*arg):
    for item in arg:
        a = int(item / 2)
        print(a)

In [ ]:
uganda(1,2,4,6,8)

In [ ]:
def addition(*arg):
    result = 0
    for item in arg:
        result = item + result
        print(result)

In [ ]:
addition(1,2,3,4)

In [ ]:
class computer:
    def __init__(self,mouse,keyboard,ram):
        self.mouse = mouse
        self.keyboard = keyboard
        self.ram = ram
    
    def acer_laptop(self):
        return self.mouse
    
    def vivi_laptop(self):
        return self.keyboard
    
    def hp_laptop(self):
        return self.ram
    
class phone:
    def __init__(self,processing,price,look,color):
        self.processing = processing
        self.price = price
        self.look = look
        self.color = color
        
        def samsung(self):
            return self.processing,self.price
        
        def redme(self):
            return self.look, self.color

In [ ]:
a = computer(mouse = 'good', keyboard = 'excellence', ram = 'great')

In [ ]:
a.acer_laptop()
b = a.acer_laptop()
c = a.vivi_laptop()
d = a.hp_laptop()

In [ ]:
print(f'Acer laptop gives {b} mouse where as Vivi laptop provide {c} keyboard and hp laptop contain {d} processing ram. ')

In [ ]:
class Animal:
    tttt = 'ilikeu'
    def __init__(self,huge,strong,clever,fast):
        self.huge = huge
        self.strong = strong
        self.clever = clever
        self.fast = fast
        
class Birds(Animal):
    def __init__(self,fly,wings,leg,huge,strong,clever,fast):
        self.fly = fly
        self.wings = wings
        self.leg = leg
        
        super().__init__(huge,strong,clever,fast)
        
    def eagle(self):
        return self.fly
    
    def sparrow(self):
        return self.wings
    
    def animal_feature(self):
        return self.huge, self.strong, self.clever, self.fast

In [ ]:
q = Birds(fly = 'high', wings = 'Two', leg = 'Two', huge = 'bulk', strong = 'strongest', clever = 'Very clever', fast = 'fastest')

In [ ]:
q.eagle()

In [ ]:
q.animal_feature()

In [ ]:
Animal.tttt

In [ ]:
b,s,v,f = q.animal_feature()

In [ ]:
print(f'Elephant seems to be {b} and it is the {s} animal too. But Fox seems to be {v} and Cheetas is known as the {f} animal.')

In [ ]:
def glass(*arg):
    for item in arg:
        result = int(item / 3)
        print(result)

In [ ]:
glass(6,3,9,27)

In [28]:
# Prime number 
for num in range(0,10):
    if num > 1:
        for item in range(2,num):
            if num % item == 0:
                break
        else:
            print(num)

2
3
5
7

In [ ]:
for num in range(10):
    print(num)

In [ ]:
# fibanacci
num1 = 0
num2 = 1
for item in range(10):
    print(num1)
    result = num1 + num2
    num1 = num2
    num2 = result

In [ ]:
# factorial
num = 5
factorial = 1
for item in range(1,num+1):
    factorial = item * factorial
print(factorial)

In [ ]:
def hd():
    pass

In [ ]:
for title in range(4,9):
    if title < 3:
        print(title)
    elif title == 0:
        print('zero')
    else:
        print('title')

In [ ]:
# program to print wheather the number is even or odd even number
num = int(input('Enter a number:'))

if num / 2 == 0:
    print(f'The given number is even number.')
else:
    print('The given number is not even number')

In [ ]:
# first 10 even number
for num in range(10):
    if num > 1:
        if num % 2 == 0:
            print(num)
        else:
            continue

In [ ]:
# fist 10 natural number
for num in range(1,11):
    print(f'The first ten natural number are: {num}')

In [ ]:
for num in range(1,30):
    if num > 1:
        for item in range(2,num):
            if num % item == 0:
                break
        else:
            print(num)

In [ ]:
num1 = 0
num2 = 1
for item in range(10)

In [5]:
a = [1,2,3,4]
type(a)

list

In [6]:
id(a)

2194075022976

In [10]:
a = [1,2,3,4,5]
a[3] = 4.3
a

[1, 2, 3, 4.3, 5]

In [12]:
a = ['Prajwal','Bishal']
a[1][0]

'B'

In [4]:
a = [1,2,3,4,5]
d = a[0]
a[0] = a[4]
a[4] = d
a

[5, 2, 3, 4, 1]

In [16]:

a = []
n =  int(input('Enter the elements of list to be assigned:'))
for i in range(n):
    v = int(input('Enter a element'+ str(i+0)+':'))
    a.append(v)
print(f'YOur given list id {a}')
new = a[0]
a[0] = a[n-1]
a[n-1] = new
print(f'The swapping list is :{a}')

Enter the elements of list to be assigned:3
Enter a element0:12
Enter a element1:5
Enter a element2:3
YOur given list id [12, 5, 3]
The swapping list is :[3, 5, 12]

In [11]:
 for i in 'myblog':
        print(i,'?')

m ?
y ?
b ?
l ?
o ?
g ?

In [23]:
# factorial 
num = 5
factorial = 1
for i in range(1,num+1):
    factorial = i * factorial 
print(factorial)

120

In [3]:
# prime number
a = int(input('Enter the number:'))
b = int(input('Enter the number:'))
for i in range(a,b):
    if i > 1:
        for num in range(2,i):
            if i % num == 0:
                break
        else:
            print(i)

Enter the number:1
Enter the number:9
2
3
5
7

In [5]:
# fibonacci 
num1 = 0
num2 = 1
for i in range(10):
    print(num1)
    result = num1 + num2
    num1 = num2 
    num2 = result

0
1
1
2
3
5
8
13
21
34

In [7]:
a = []
v = int(input('Enter the element of list:'))
for i in range(v):
    n = int(input('Enter a element'+str(i+0) + ':'))
    a.append(n)
num = a[0]
a[0] = a[v-1]
a[v-1] = num
print(f'The swapped element of list is {v}')

Enter the element of list:3
Enter a element0:1
Enter a element1:2
Enter a element2:3
The swapped element of list is 3

In [11]:

a = []
n =  int(input('Enter the elements of list to be assigned:'))
for i in range(0,n):
    v = int(input('Enter a element'+ str(i+1)+':'))
    a.append(v)
new = a[0]
a[0] = a[n-1]
a[n-1] = new
print(f'The swapping list is :{a}')

Enter the elements of list to be assigned:3
Enter a element1:1
Enter a element2:2
Enter a element3:3
The swapping list is :[3, 2, 1]

In [51]:
class Bird:
    def __init__(self,beak,leg,wings,power,ability):
        self.beak = beak
        self.leg = leg
        self.wings = wings
        self.power = power
        self.ability = ability
    
    def eagle(self):
        return self.ability, self.power
    
    def dove(self):
        return self.beak, self.leg
    
    
class animal(Bird):
    def __init__(self,fur,strong,beak,leg,wings,power,ability):
        self.fur = fur
        self.strong = strong
        super().__init__(beak,leg,wings,power,ability)
        
    def bird_group(self):
        return self.beak,self.leg,self.wings,self.power,self.ability

In [52]:
b = animal(fur='thick',strong='strongest',beak='small',leg = 'two', wings='two',power= 'powerful',ability='clever')

In [53]:

b.bird_group()

('small', 'two', 'two', 'powerful', 'clever')

In [54]:
x,y,z,v,t = b.bird_group()

In [55]:
print(f'Eagle is the {x} birds which have {y} legs and have {z} wings as well as it is known as {v} birds having {t} minds. ')

Eagle is the small birds which have two legs and have two wings as well as it is known as powerful birds having clever minds.

In [56]:
l = [1,2,3,4,5]
b = [7,6,9,10]
l.append(2)
l

[1, 2, 3, 4, 5, 2]

In [57]:
l.extend(b)
l

[1, 2, 3, 4, 5, 2, 7, 6, 9, 10]

In [58]:
v = ['q','w','e','r','t','y']
v[2] = 'E'
v

['q', 'w', 'E', 'r', 't', 'y']

In [59]:
v.sort(reverse = True)
v

['y', 'w', 't', 'r', 'q', 'E']

In [70]:

c = {'animal' : 2 , 'birds' : 2, 'wateranimal' : 2 }
c
c.keys()
c.values()

dict_values([2, 2, 2])

In [65]:
a = {'apple' :1, 'ball' :2, 'car' :3} # key : value pair
a

{'apple': 1, 'ball': 2, 'car': 3}

In [73]:
a['ball']='www'

In [74]:
a

{'apple': 1, 'ball': 'www', 'car': 3, 1: 'www'}

In [81]:
c = {'animal' : 2 , 'birds' : 2, 'wateranimal' : 2 }

SyntaxError: cannot assign to function call here. Maybe you meant '==' instead of '='? (1406620277.py, line 1)

In [4]:
tup1 = (1,2,34)
tup2 = (5,8,9,9)
tup1*3 + tup2

(1, 2, 34, 1, 2, 34, 1, 2, 34, 5, 8, 9, 9)

In [5]:
tup1 = (10,20,40)
tup2 = (1,2,6,77,88)
min(tup1)

10

In [6]:

max(tup2)

88

In [7]:
import numpy as np

In [8]:
g = np.array([1,2,3,4,5])
g

array([1, 2, 3, 4, 5])

In [9]:
g[0]

1

In [10]:
g[0:4:2]

array([1, 3])

In [11]:
len(g)

5

In [12]:
import pandas as pd

In [19]:
n = pd.Series([1,2,3,4,5,6])

In [20]:
n

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [21]:
type(n)

pandas.core.series.Series

In [24]:
s = pd.Series([1,2,3,4,5,6], index = ['a','b','c','d','e','f'])
s

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [25]:
s[0]

1

In [30]:
d = pd.Series({'fruits' : 'orange', 'animal' : 'fox'})

In [31]:
d

fruits    orange
animal       fox
dtype: object

In [32]:
d['animal']

'fox'

# Practise of all for gaining knowledge

# list
* Append , Extend , Sort , Reverse , Insert , Update , Pop , Index , Len , Slicing , Clear , Count .

In [2]:
f = [1,2,3,4,5,6,7,7,3,2,1,4,4,3,2,1,5,6]
g = [22,22,22,44,44,44,88]

In [3]:
f.append(999999)
f

[1, 2, 3, 4, 5, 6, 7, 7, 3, 2, 1, 4, 4, 3, 2, 1, 5, 6, 999999]

In [8]:
o = [2,3,4,4]
d = [3,3,3,3]
d.extend(o)
d

[3, 3, 3, 3, 2, 3, 4, 4]

In [13]:
o.extend(d)
print(o)

[2, 3, 4, 4, 3, 3, 3, 3, 2, 3, 4, 4, 3, 3, 3, 3, 2, 3, 4, 4, 3, 3, 3, 3, 2, 3, 4, 4, 3, 3, 3, 3, 2, 3, 4, 4, 3, 3, 3, 3, 2, 3, 4, 4]

In [15]:
k = [2,3,4,5,6,6,8]
k.sort()
k

[2, 3, 4, 5, 6, 6, 8]

In [16]:
k.reverse()

In [17]:

k

[8, 6, 6, 5, 4, 3, 2]

In [19]:
g = [1,3,4,2,5,6,78]
g.pop()
g

[1, 3, 4, 2, 5, 6]

In [20]:
g[0] = 'prajwal'
g

['prajwal', 3, 4, 2, 5, 6]

In [21]:
g.insert(1,'giri')
g

['prajwal', 'giri', 3, 4, 2, 5, 6]

In [22]:
g[0:5:2]

['prajwal', 3, 2]

In [23]:
g

['prajwal', 'giri', 3, 4, 2, 5, 6]

In [24]:
g[1]

'giri'

In [25]:
len(g)

7

In [27]:
g.count(5)

1

In [29]:
g.clear()
g

[]

In [31]:
g.count(2)

0

In [32]:
import seaborn as sns

In [33]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [35]:
d = sns.load_dataset('titanic')
d

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [36]:
d.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [37]:
d.tail(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [38]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [41]:
a, b = d.shape

In [42]:
print(f'The above table contain {a} rows and {b} columns. ')

The above table contain 891 rows and 15 columns.

In [50]:
d.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [51]:
d.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [57]:
d.loc[(d['sex'] == 'male') & (d['embark_town'] == 'Southampton')]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True

In [59]:
d.iloc[1:5, 0:3]

   survived  pclass     sex
1         1       1  female
2         1       3  female
3         1       1  female
4         0       3    male

In [60]:
d.loc[0:7,['sex','survived','age']]

      sex  survived   age
0    male         0  22.0
1  female         1  38.0
2  female         1  26.0
3  female         1  35.0
4    male         0  35.0
5    male         0   NaN
6    male         0  54.0
7    male         0   2.0

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [4]:
v = sns.load_dataset('taxis')
v

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.60,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan
1,2019-03-04 16:11:55,2019-03-04 16:19:00,1,0.79,5.0,0.00,0.0,9.30,yellow,cash,Upper West Side South,Upper West Side South,Manhattan,Manhattan
2,2019-03-27 17:53:01,2019-03-27 18:00:25,1,1.37,7.5,2.36,0.0,14.16,yellow,credit card,Alphabet City,West Village,Manhattan,Manhattan
3,2019-03-10 01:23:59,2019-03-10 01:49:51,1,7.70,27.0,6.15,0.0,36.95,yellow,credit card,Hudson Sq,Yorkville West,Manhattan,Manhattan
4,2019-03-30 13:27:42,2019-03-30 13:37:14,3,2.16,9.0,1.10,0.0,13.40,yellow,credit card,Midtown East,Yorkville West,Manhattan,Manhattan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6428,2019-03-31 09:51:53,2019-03-31 09:55:27,1,0.75,4.5,1.06,0.0,6.36,green,credit card,East Harlem North,Central Harlem North,Manhattan,Manhattan
6429,2019-03-31 17:38:00,2019-03-31 18:34:23,1,18.74,58.0,0.00,0.0,58.80,green,credit card,Jamaica,East Concourse/Concourse Village,Queens,Bronx
6430,2019-03-23 22:55:18,2019-03-23 23:14:25,1,4.14,16.0,0.00,0.0,17.30,green,cash,Crown Heights North,Bushwick North,Brooklyn,Brooklyn
6431,2019-03-04 10:09:25,2019-03-04 10:14:29,1,1.12,6.0,0.00,0.0,6.80,green,credit card,East New York,East Flatbush/Remsen Village,Brooklyn,Brooklyn
6432,2019-03-13 19:31:22,2019-03-13 19:48:02,1,3.85,15.0,3.36,0.0,20.16,green,credit card,Boerum Hill,Windsor Terrace,Brooklyn,Brooklyn

In [5]:
v.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6433 entries, 0 to 6432
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   pickup           6433 non-null   datetime64[ns]
 1   dropoff          6433 non-null   datetime64[ns]
 2   passengers       6433 non-null   int64
 3   distance         6433 non-null   float64
 4   fare             6433 non-null   float64
 5   tip              6433 non-null   float64
 6   tolls            6433 non-null   float64
 7   total            6433 non-null   float64
 8   color            6433 non-null   object
 9   payment          6389 non-null   object
 10  pickup_zone      6407 non-null   object
 11  dropoff_zone     6388 non-null   object
 12  pickup_borough   6407 non-null   object
 13  dropoff_borough  6388 non-null   object
dtypes: datetime64[ns](2), float64(5), int64(1), object(6)
memory usage: 703.7+ KB

In [8]:
a, b = v.shape

In [9]:
print(f'The above table contain {a} rows and {b} columns. ')

The above table contain 6433 rows and 14 columns.

In [10]:
v.head(2)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.60,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan
1,2019-03-04 16:11:55,2019-03-04 16:19:00,1,0.79,5.0,0.00,0.0,9.30,yellow,cash,Upper West Side South,Upper West Side South,Manhattan,Manhattan

In [13]:
v.loc[(v['pickup_borough'] == 'Manhattan') & (v['payment'] == 'cash')]
v

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.60,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan
1,2019-03-04 16:11:55,2019-03-04 16:19:00,1,0.79,5.0,0.00,0.0,9.30,yellow,cash,Upper West Side South,Upper West Side South,Manhattan,Manhattan
2,2019-03-27 17:53:01,2019-03-27 18:00:25,1,1.37,7.5,2.36,0.0,14.16,yellow,credit card,Alphabet City,West Village,Manhattan,Manhattan
3,2019-03-10 01:23:59,2019-03-10 01:49:51,1,7.70,27.0,6.15,0.0,36.95,yellow,credit card,Hudson Sq,Yorkville West,Manhattan,Manhattan
4,2019-03-30 13:27:42,2019-03-30 13:37:14,3,2.16,9.0,1.10,0.0,13.40,yellow,credit card,Midtown East,Yorkville West,Manhattan,Manhattan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6428,2019-03-31 09:51:53,2019-03-31 09:55:27,1,0.75,4.5,1.06,0.0,6.36,green,credit card,East Harlem North,Central Harlem North,Manhattan,Manhattan
6429,2019-03-31 17:38:00,2019-03-31 18:34:23,1,18.74,58.0,0.00,0.0,58.80,green,credit card,Jamaica,East Concourse/Concourse Village,Queens,Bronx
6430,2019-03-23 22:55:18,2019-03-23 23:14:25,1,4.14,16.0,0.00,0.0,17.30,green,cash,Crown Heights North,Bushwick North,Brooklyn,Brooklyn
6431,2019-03-04 10:09:25,2019-03-04 10:14:29,1,1.12,6.0,0.00,0.0,6.80,green,credit card,East New York,East Flatbush/Remsen Village,Brooklyn,Brooklyn
6432,2019-03-13 19:31:22,2019-03-13 19:48:02,1,3.85,15.0,3.36,0.0,20.16,green,credit card,Boerum Hill,Windsor Terrace,Brooklyn,Brooklyn

In [14]:
v.iloc[1:4, 2:7]

   passengers  distance  fare   tip  tolls
1           1      0.79   5.0  0.00    0.0
2           1      1.37   7.5  2.36    0.0
3           1      7.70  27.0  6.15    0.0

In [17]:
df = sns.load_dataset('tips')

In [ ]:
|